Repository: pypi-data/pypi-mirror-154
Catalog: packages/Red-DiscordBot/Red-DiscordBot-3.4.17.tar.gz/Red-DiscordBot-3.4.17/redbot/cogs/alias/locales/*.po
Languages: vi_vn

source: Create aliases for commands. Aliases are alternative names/shortcuts for commands. They can act as both a lambda (storing arguments for repeated use) or as simply a shortcut to saying "x y z". When run, aliases will accept any additional arguments and append them to the stored alias.
vi_vn: Tạo lỗi tắt cho câu lệnh. Dùng để rút ngắn một câu lệnh bằng một từ hoặc chữ cái ngắn gọn hơn. (Chúng sẽ đóng vai trò giống nhau).

source: Aliases:
vi_vn: Bí danh:

source: Page {page}/{total}
vi_vn: Trang {page} trên tổng số {total}

source: Manage command aliases.
vi_vn: Quản lí bí danh hoặc lối tắt của câu lệnh.

source: Manage global aliases.
vi_vn: Quản lý bí danh hoặc lối tắt dùng chung.

source: Add an alias for a command.
vi_vn: Thêm bí danh hoặc lối tắt cho một câu lệnh.

source: You attempted to create a new alias with the name {name} but that name is already a command on this bot.
vi_vn: Bạn vừa tạo lỗi tắt {name} nhưng nó đã bị trùng với một câu lệnh có sẵn.

source: You attempted to create a new alias with the name {name} but that alias already exists.
vi_vn: Bạn vừa tạo lối tắt mới có tên {name} nhưng nó đã tồn tại rồi.

source: You attempted to create a new alias with the name {name} but that name is an invalid alias name. Alias names may not contain spaces.
vi_vn: Bạn vừa tạo lối tắt {name} nhưng đó không phải là cách đặt tên lối tắt. Tên của lối tắt không được có dấu cách.

source: You attempted to create a new alias for a command that doesn't exist.
vi_vn: Câu lệnh đó không tồn tại để tạo lối tắt.

source: A new alias with the trigger `{name}` has been created.
vi_vn: Một lối tắt với tên `{name}` đã được tạo.

source: Add a global alias for a command.
vi_vn: Thêm bí danh hoặc lối tắt dùng chung cho một câu lệnh.

source: You attempted to create a new global alias with the name {name} but that name is already a command on this bot.
vi_vn: Bạn vừa tạo lỗi tắt dùng chung với tên {name} nhưng nó đã bị trùng với một câu lệnh có sẵn.

source: You attempted to create a new global alias with the name {name} but that alias already exists.
vi_vn: Bạn vừa tạo lối tắt dùng chung mới có tên {name} nhưng nó đã tồn tại rồi.

source: You attempted to create a new global alias with the name {name} but that name is an invalid alias name. Alias names may not contain spaces.
vi_vn: Bạn vừa tạo lối tắt dùng chung với tên {name} nhưng đó không phải là cách đặt tên lối tắt. Tên của lối tắt không được có dấu cách.

source: A new global alias with the trigger `{name}` has been created.
vi_vn: Một lối tắt dùng chung với tên `{name}` đã được tạo.

source: Edit an existing alias in this server.
vi_vn: Chỉnh sửa lỗi tắt hoặc bí danh trên server này.

source: The alias with the name {name} does not exist.
vi_vn: Lối tắt {name} không tồn tại.

source: You attempted to edit an alias to a command that doesn't exist.
vi_vn: Bạn vừa chỉnh sửa lối tắt của một câu lệnh không tồn tại.

source: The alias with the trigger `{name}` has been edited sucessfully.
vi_vn: Lối tắt với tên `{name}` đã được tạo thành công.

source: Alias with the name `{name}` was not found.
vi_vn: Không tim thấy lối tắt với tên `{name}`.

source: Edit an existing global alias.
vi_vn: Chỉnh sửa lối tắt dùng chung.

source: Try to execute help for the base command of the alias.
vi_vn: Hãy thử dùng trợ giúp cho câu lệnh cơ bản về lối tắt, bí danh.

source: No such alias exists.
vi_vn: Không có lối tắt, bí danh này.

source: Show what command the alias executes.
vi_vn: Xem lối tắt, bí danh sẽ chạy câu lệnh nào.

source: The `{alias_name}` alias will execute the command `{command}`
vi_vn: Lối tắt, bí danh `{alias_name}` sẽ chạy câu lệnh `{command}`

source: There is no alias with the name `{name}`
vi_vn: Không có lối tắt hay bí danh nào với tên `{name}`

source: Delete an existing alias on this server.
vi_vn: Xóa một lối tắt, bí danh đang tồn tai trên máy chủ này.

source: There are no aliases on this server.
vi_vn: Không có bất kì lối tắt hay bí danh nào được thiết lập.

source: Alias with the name `{name}` was successfully deleted.
vi_vn: Lối tắt, bí danh với tên `{name}` đã bị xóa.

source: Alias with name `{name}` was not found.
vi_vn: Không tìm thấy lối tắt `{name}`.

source: Delete an existing global alias.
vi_vn: Xóa một lối tắt dùng chung.

source: There are no global aliases on this bot.
vi_vn: Không có bất kì lối tắt hay bí danh dùng chung nào được đặt.

source: List the available aliases on this server.
vi_vn: Danh sách tổng hợp những lối tắt, bí danh của câu lệnh tồn tại trên máy chủ này.

source: List the available global aliases on this bot.
vi_vn: Danh sách tổng hợp những lối tắt, bí danh dùng chung của câu lệnh tồn tại trên máy chủ này.

source: There are no global aliases.
vi_vn: Không có lối tắt hay bí danh dùng chung nào.

source: Arguments must be specified with a number.
vi_vn: Cú pháp phải được ghi rõ ràng bằng một con số.

source: Arguments must be sequential. Missing arguments:
vi_vn: Cú pháp phải tuần tự. Bị thiếu cú pháp:
