Repository: pypi-data/pypi-mirror-154
Catalog: packages/djangoldp-circle/djangoldp_circle-2.1.19.tar.gz/djangoldp_circle-2.1.19/djangoldp_circle/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Someone requested access to your circle
fr: Quelqu'un a demandé l'accès à votre cercle

source: Your access request has been accepted
fr: Votre demande d'accès a été accepté

source: Your access request has been refused
fr: Votre demande d'accès a été refusé

source: New Circle access request
fr: Nouvelle demande d'accès à un cercle

source: Circle access request
fr: Demande d'accès à un cercle

source: requested access to your circle:
fr: a demandé l'accès à votre cercle:

source: Don't respond directly to this email.
fr: Ne répondez pas directement à cet email.

source: Instead, find the request at
fr: A la place, vous pouvez retrouver la demande sur

source: Your request to access the circle
fr: Votre demande d'accès au cercle

source: has been
fr: a été

source: accepted
fr: accepté

source: denied
fr: refusé
