Repository: pypi-data/pypi-mirror-154
Catalog: packages/senaite.core/senaite.core-2.2.0.zip/senaite.core-2.2.0/src/senaite/core/locales/*/LC_MESSAGES/plone.po
Languages: pt_br

source: Alternative formats
pt_br: Formatos alternativos

source: Apply rule on the whole site
pt_br: Aplicar regra em todo site

source: Configure rule
pt_br: Configurar regra

source: Content rule settings updated.
pt_br: Configurações de regra de conteúdo atualizadas

source: Contents
pt_br: Conteúdos

source: Disable globally
pt_br: Desativar globalmente

source: Displayed content types
pt_br: Tipos de conteúdos exibidos

source: Enabled
pt_br: Habilitado

source: Error
pt_br: Erro

source: Filter:
pt_br: Filtro:

source: Go to parent folder
pt_br: Ir para a pasta raiz

source: Go to the folder where you want the rule to apply, or at the site root, click on 'rule' tab, and then locally setup the rules.
pt_br: Vá para a pasta onde você deseja que a regra seja aplicada, ou na raiz do site, clique na guia 'regra' e configure localmente as regras.

source: Go to the upgrade page
pt_br: Vá para a página de atualização

source: Home
pt_br: Origem

source: Log in
pt_br: Conectar

source: Log out
pt_br: Desconectar

source: Move down
pt_br: Mover para baixo

source: Move up
pt_br: Mover para cima

source: Off
pt_br: Desligado

source: On
pt_br: Ligado

source: Relative URL for the SENAITE toolbar logo
pt_br: URL relativa do logotipo da barra de ferramentas do SENAITE

source: Select which formats are available for users as alternative to the default format. Note that if new formats are installed, they will be enabled for text fields by default unless explicitly turned off here or by the relevant installer.
pt_br: Selecione quais formatos estão disponíveis para os usuários como alternativa ao formato padrão. Observe que, se novos formatos forem instalados, eles serão habilitados para campos de texto por padrão, a menos que sejam explicitamente desativados aqui ou pelo instalador.

source: Server:
pt_br: Servidor:

source: Site Setup
pt_br: Configuração do site

source: Site title
pt_br: Título do site

source: The content types that should be shown in the navigation and site map.
pt_br: Tipos de conteúdos que devem ser mostrados na navegação e no mapa do site.

source: The rule is enabled but will perform nothing since it is not assigned anywhere.
pt_br: A regra está habilitada, mas não executará nada, pois não está atribuída a nenhum lugar.

source: The site configuration is outdated and needs to be upgraded. Please ${link_continue_with_the_upgrade}.
pt_br: A configuração do site está desatualizada e precisa ser atualizada. Por favor ${link_continue_with_the_upgrade}.

source: There is not any action performed by this rule. Click on Add button to setup an action.
pt_br: Não há nenhuma ação realizada por esta regra. Clique no botão Adicionar para configurar uma ação.

source: There is not any additional condition checked on this rule.
pt_br: Não há nenhuma condição adicional verificada nesta regra.

source: There was an error saving content rules.
pt_br: Ocorreu um erro ao salvar as regras de conteúdo.

source: This must be a URL relative to the site root.
pt_br: Este deve ser um URL relativo à raiz do site.

source: This rule is not assigned to any location
pt_br: Esta regra não está atribuída a nenhum local

source: This shows up in the title bar of browsers and in syndication feeds.
pt_br: Isso aparece na barra de título dos navegadores e nos feeds de distribuição.

source: Toggle sidebar visibility
pt_br: Alternar a visibilidade da barra lateral

source: Whether or not content rules should be disabled globally. If this is selected, no rules will be executed anywhere in the portal.
pt_br: Se as regras de conteúdo devem ou não ser desabilitadas globalmente. Se estiver selecionado, nenhuma regra será executada em nenhum lugar do portal.

source: contentrules_add_action
pt_br: regrasdeconteúdo_adicionar_ação

source: contentrules_add_condition
pt_br: regrasdeconteúdo_adicionar_condição

source: contentrules_assignments_shortcuts
pt_br: regrasdeconteúdo_atalhos_atribuições

source: contentrules_description_cascading
pt_br: regrasdeconteúdo_descrição_em_cascata

source: contentrules_description_description
pt_br: regrasdeconteúdo_descrição_descrição

source: contentrules_description_stop
pt_br: regrasdeconteúdo_descrição_parar

source: contentrules_description_trigger
pt_br: regrasdeconteúdo_descrição_acionar

source: contentrules_perform_actions
pt_br: regrasdeconteúdo_realizar_ações

source: continue with the upgrade
pt_br: continue com a atualização

source: description_available_languages
pt_br: descrição_linguagens_disponíveis

source: description_contentrule_title
pt_br: descrição_regrasdeconteúdo_título

source: description_contentrules_rule_assignments
pt_br: descrição_regrasdeconteúdo_regra_atribuição

source: description_control_panel
pt_br: descrição_painel_controle

source: description_cookie_manual_override
pt_br: descrição_substituição_manual_cookie

source: footer_login_link_get_help
pt_br: rodapé_login_link_obter_ajuda

source: footer_login_link_signup
pt_br: rodapé_login_link_inscrever-se

source: go_to_contentrules_management
pt_br: vá_para_regrasdeconteúdo_gerenciador

source: heading_add_item
pt_br: cabeçalho_adicionar_item

source: heading_available_languages
pt_br: cabeçalho_linguagens_disponíveis

source: heading_cookie_manual_override
pt_br: cabeçalho_substituição_manual_cookie

source: heading_edit_item
pt_br: cabeçalho_editar_item

source: heading_portlets_assigned_here
pt_br: cabeçalho_portlets_atribuído_aqui

source: heading_version_overview
pt_br: cabeçalho_versão_visãogeral

source: if_all_conditions_met
pt_br: se_todas_condições_coincidem

source: inactive
pt_br: inativo

source: label_add
pt_br: adicionar_rótulo

source: label_add_portlet
pt_br: rótulo_adicionar_portlet

source: label_add_portlet_ellipsis
pt_br: rótulo_adicionar_portlet_elipse

source: label_cancel
pt_br: rótulo_cancelar

source: label_contentrule_add
pt_br: rótulo_regradeconteúdo_adicionar

source: label_contentrules_rule_assignments
pt_br: rótulo_regradeconteúdo_regra_atribuições

source: label_contentrules_rule_enabled
pt_br: rótulo_regradeconteúdo_regra_habilitar

source: label_contentrules_rule_event
pt_br: rótulo_regradeconteúdo_regra_evento

source: label_contentrules_rule_listing
pt_br: rótulo_regradeconteúdo_regra_listagem

source: label_convert_portlets
pt_br: rótulo_converter_portlets

source: label_delete
pt_br: rótulo_deletar

source: label_description
pt_br: rótulo_descrição

source: label_disable
pt_br: rótulo_desabilitar

source: label_edit
pt_br: rótulo_editar

source: label_edit_default_view_container_go_here
pt_br: rótulo_editar_padrão_visualizar_vá_aqui

source: label_enable
pt_br: rótulo_habilitar

source: label_hide_item
pt_br: rótulo_ocultar_item

source: label_manage_portlets_default_view_container_go_here
pt_br: rótulo_gerenciar_portlets_padrão_visualizar_recipiente_vá_aqui

source: label_next
pt_br: rótulo_próximo

source: label_no_prefs_panels_available
pt_br: rótulo_sem_preferências_painéis_disponível

source: label_previous
pt_br: rótulo_anterior

source: label_remove
pt_br: rótulo_remover

source: label_rule_event_trigger
pt_br: rótulo_regra_evento_acionar

source: label_save
pt_br: rótulo_salvar

source: label_show_item
pt_br: rótulo_mostrar_item

source: legend-contentrules
pt_br: legenda-regrasdeconteúdo

source: need_an_account
pt_br: precisa_uma_conta

source: return_to_view
pt_br: retornar_para_visualização

source: text_no_mailhost_configured_control_panel_link
pt_br: texto_sem_mailhost_configurado_painel_de_controle_link

source: text_no_pil_installed
pt_br: texto_sem_pilha_instalada

source: text_no_timezone_configured_control_panel_link
pt_br: texto_sem_fuso_horário_configurado_painel_de_controle_link

source: title_edit_contentrule
pt_br: título_editar_regradeconteúdo

source: title_legacy_portlets
pt_br: título_legado_portlets

source: title_manage_contentrules
pt_br: título_gerenciar_regrasdeconteúdo

source: title_manage_contextual_portlets
pt_br: título_gerenciar_contextual_porlets

source: trouble_logging_in
pt_br: problema_logando

source: unassigned
pt_br: Não atribuído
